In [1]:
import pandas as pd

In [2]:
df_users = pd.read_csv('dsv1069_users.csv')
df_orders = pd.read_csv('dsv1069_orders.csv')
df_items = pd.read_csv('dsv1069_items.csv')
df_events = pd.read_csv('dsv1069_events.csv')
df_date = pd.read_csv('dsc1069_date_rollup.csv')

/var/folders/s_/r90svjs50h9b752srkd7pr3w0000gp/T/ipykernel_1552/2340850340.py:4: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  df_events = pd.read_csv('dsv1069_events.csv')

# df_users

In [6]:
df_users.head(8)

,created_at,deleted_at,email_address,first_name,id,last_name,merged_at,parent_user_id
0,2014-12-20 07:07:45,NaN,ArataHopper@earthlink.info,Arata,51590.0,Hopper,NaN,NaN
1,2016-10-14 05:39:20,NaN,Riya_Gruber1974@mail.net,Riya,158891.0,Gruber,NaN,NaN
2,2017-01-21 10:20:09,NaN,Peter_Sousa@yahoo.info,Peter,179949.0,Sousa,NaN,NaN
3,2015-10-30 21:31:30,NaN,D_Kowalski1962@gmail.com,D,98000.0,Kowalski,NaN,NaN
4,2015-10-24 16:27:27,NaN,SNovak1966@mail.com,S,93994.0,Novak,NaN,NaN
5,2017-01-08 17:44:28,NaN,Robot_Santos@yahoo.biz,Robot,179853.0,Santos,NaN,NaN
6,2015-02-07 22:39:03,NaN,Luis_Wilson1996@inbox.org,Luis,58011.0,Wilson,NaN,NaN
7,2015-03-29 09:38:01,NaN,D_Powell1991@yahoo.edu,D,64712.0,Powell,NaN,NaN

In [11]:
df_users.isnull().sum().sort_values(ascending=False)

deleted_at        114290
merged_at         110770
parent_user_id    110770
created_at             0
email_address          0
first_name             0
id                     0
last_name              0
dtype: int64

In [16]:
df_users[df_users.isnull().any(axis=1)].head()

,created_at,deleted_at,email_address,first_name,id,last_name,merged_at,parent_user_id
0,2014-12-20 07:07:45,NaN,ArataHopper@earthlink.info,Arata,51590.0,Hopper,NaN,NaN
1,2016-10-14 05:39:20,NaN,Riya_Gruber1974@mail.net,Riya,158891.0,Gruber,NaN,NaN
2,2017-01-21 10:20:09,NaN,Peter_Sousa@yahoo.info,Peter,179949.0,Sousa,NaN,NaN
3,2015-10-30 21:31:30,NaN,D_Kowalski1962@gmail.com,D,98000.0,Kowalski,NaN,NaN
4,2015-10-24 16:27:27,NaN,SNovak1966@mail.com,S,93994.0,Novak,NaN,NaN

In [48]:
df_users.duplicated().sum()

0

In [63]:
df_users.count()

created_at        117178
deleted_at          2888
email_address     117178
first_name        117178
id                117178
last_name         117178
merged_at           6408
parent_user_id      6408
dtype: int64

In [61]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117178 entries, 0 to 117177
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   created_at      117178 non-null  object
 1   deleted_at      2888 non-null    object
 2   email_address   117178 non-null  object
 3   first_name      117178 non-null  object
 4   id              117178 non-null  float64
 5   last_name       117178 non-null  object
 6   merged_at       6408 non-null    object
 7   parent_user_id  6408 non-null    float64
dtypes: float64(2), object(6)
memory usage: 7.2+ MB

In [99]:
print(f'created_at:')
print(df_users.created_at.nunique())
print(f'deleted_at:')
print(df_users.deleted_at.nunique())
print(f'email_address:')
print(df_users.email_address.nunique())
print(f'first_name:')
print(df_users.first_name.nunique())
print(f'id:')
print(df_users.id.nunique())
print(f'last_name:')
print(df_users.last_name.nunique())
print(f'merged_at:')
print(df_users.merged_at.nunique())
print(f'parent_user_id:')
print(df_users.parent_user_id.nunique())

created_at:
117136
deleted_at:
2888
email_address:
112395
first_name:
116
id:
117178
last_name:
83
merged_at:
3209
parent_user_id:
3209

**--------------------------------------------------------------------------------------------------------------------------------------------------------------------**

# df_orders

In [7]:
df_orders.head(8)

,invoice_id,line_item_id,user_id,item_id,item_name,item_category,price,created_at,paid_at
0,192320.0,83118.0,178481.0,3526.0,digital apparatus,apparatus,330.0,2017-06-28 21:14:25,2017-06-27 21:19:39
1,192320.0,207309.0,178481.0,1514.0,miniature apparatus cleaner,apparatus,99.0,2017-06-28 21:14:25,2017-06-27 21:19:39
2,192320.0,392027.0,178481.0,3712.0,miniature apparatus cleaner,apparatus,99.0,2017-06-28 21:14:25,2017-06-27 21:19:39
3,80902.0,243831.0,154133.0,3586.0,reflective instrument,instrument,57.2,2016-10-09 06:57:30,2016-10-07 10:08:10
4,80902.0,399806.0,154133.0,1061.0,extra-strength instrument charger,instrument,17.6,2016-10-09 06:57:30,2016-10-07 10:08:10
5,211144.0,19924.0,119514.0,550.0,miniature apparatus refill,apparatus,132.0,2016-07-25 08:01:15,2016-07-23 11:32:43
6,123735.0,154006.0,164581.0,982.0,miniature module carrying_case,module,33.0,2016-11-24 07:35:34,2016-11-26 20:52:06
7,123735.0,66700.0,164581.0,858.0,industrial-strength module,module,300.0,2016-11-24 07:35:34,2016-11-26 20:52:06

In [12]:
df_orders.isnull().sum().sort_values(ascending=False)

invoice_id       0
line_item_id     0
user_id          0
item_id          0
item_name        0
item_category    0
price            0
created_at       0
paid_at          0
dtype: int64

In [19]:
df_orders[df_orders.isnull().any(axis=1)].head()

Empty DataFrame
Columns: [invoice_id, line_item_id, user_id, item_id, item_name, item_category, price, created_at, paid_at]
Index: []

In [34]:
df_users.duplicated().sum()

0

In [30]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47402 entries, 0 to 47401
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   invoice_id     47402 non-null  float64
 1   line_item_id   47402 non-null  float64
 2   user_id        47402 non-null  float64
 3   item_id        47402 non-null  float64
 4   item_name      47402 non-null  object
 5   item_category  47402 non-null  object
 6   price          47402 non-null  float64
 7   created_at     47402 non-null  object
 8   paid_at        47402 non-null  object
dtypes: float64(5), object(4)
memory usage: 3.3+ MB

In [105]:
print(f'invoice_id:')
print(df_orders.invoice_id.nunique())
print(f'line_item_id:')
print(df_orders.line_item_id.nunique())
print(f'user_id:')
print(df_orders.user_id.nunique())
print(f'item_id:')
print(df_orders.item_id.nunique())
print(f'item_name:')
print(df_orders.item_name.nunique())
print(f'item_category:')
print(df_orders.item_category.nunique())
print(f'price:')
print(df_orders.price.nunique())
print(f'created_at:')
print(df_orders.created_at.nunique())
print(f'paid_at:')
print(df_orders.paid_at.nunique())

invoice_id:
18971
line_item_id:
47402
user_id:
17463
item_id:
2198
item_name:
1011
item_category:
10
price:
354
created_at:
18970
paid_at:
18970

In [47]:
df_orders.item_category.unique()

array(['apparatus', 'instrument', 'module', 'tool', 'mechanism',
       'contraption', 'gadget', 'widget', 'device', 'dongle'],
      dtype=object)

**--------------------------------------------------------------------------------------------------------------------------------------------------------------------**

# df_items

In [8]:
df_items.head(8)

,adjective,category,created_at,id,modifier,name,price
0,fuzzy,contraption,2014-01-15 21:36:09,2512.0,carrying_case,fuzzy contraption carrying_case,150.00
1,NaN,instrument,2013-05-14 05:20:50,482.0,refill,instrument refill,35.20
2,industrial-strength,module,2014-02-04 19:28:32,2446.0,NaN,industrial-strength module,300.00
3,digital,tool,2013-02-25 12:23:18,1312.0,carrying_case,digital tool carrying_case,16.50
4,miniature,device,2013-08-05 17:20:45,3556.0,cleaner,miniature device cleaner,16.50
5,rechargable,contraption,2013-09-12 06:27:01,131.0,cleaner,rechargable contraption cleaner,195.00
6,NaN,instrument,2013-10-07 09:38:14,1178.0,how-to-manual,instrument how-to-manual,0.00
7,prize-winning,mechanism,2013-09-09 09:32:18,110.0,storage_unit,prize-winning mechanism storage_unit,41.25

In [13]:
df_items.isnull().sum().sort_values(ascending=False)

modifier      766
adjective     272
category        0
created_at      0
id              0
name            0
price           0
dtype: int64

In [50]:
df_items[df_items.isnull().any(axis=1)].head()

,adjective,category,created_at,id,modifier,name,price
1,NaN,instrument,2013-05-14 05:20:50,482.0,refill,instrument refill,35.2
2,industrial-strength,module,2014-02-04 19:28:32,2446.0,NaN,industrial-strength module,300.0
6,NaN,instrument,2013-10-07 09:38:14,1178.0,how-to-manual,instrument how-to-manual,0.0
8,NaN,mechanism,2013-10-25 22:53:25,47.0,NaN,mechanism,15.0
9,organic,tool,2013-05-10 10:19:33,1696.0,NaN,organic tool,37.5

In [44]:
df_items.id.duplicated().sum()

0

In [64]:
df_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2198 entries, 0 to 2197
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   adjective   1926 non-null   object
 1   category    2198 non-null   object
 2   created_at  2198 non-null   object
 3   id          2198 non-null   float64
 4   modifier    1432 non-null   object
 5   name        2198 non-null   object
 6   price       2198 non-null   float64
dtypes: float64(2), object(5)
memory usage: 120.3+ KB

In [106]:
print(f'adjective:')
print(df_items.adjective.nunique())
print(f'category:')
print(df_items.category.nunique())
print(f'created_at:')
print(df_items.created_at.nunique())
print(f'id:')
print(df_items.id.nunique())
print(f'modifier:')
print(df_items.modifier.nunique())
print(f'name:')
print(df_items.name.nunique())
print(f'price:')
print(df_items.price.nunique())

adjective:
13
category:
10
created_at:
2198
id:
2198
modifier:
9
name:
1011
price:
354

In [38]:
df_items.category.unique()

array(['contraption', 'instrument', 'module', 'tool', 'device',
       'mechanism', 'widget', 'apparatus', 'gadget', 'dongle'],
      dtype=object)

In [45]:
df_items.adjective.unique()

array(['fuzzy', nan, 'industrial-strength', 'digital', 'miniature',
       'rechargable', 'prize-winning', 'organic', 'reflective',
       'aerodynamic', 'analog', 'extra-strength', 'matte', 'glossy'],
      dtype=object)

**--------------------------------------------------------------------------------------------------------------------------------------------------------------------**

# df_events

In [9]:
df_events.head(8)

,event_id,event_time,user_id,event_name,platform,parameter_name,parameter_value
0,b9de71c5c3cc4cd7a97e50b832106e5a,2017-06-26 11:23:39,178481.0,view_item,android,item_id,3526
1,23267713c9ea44419331731f50b6a8db,2017-06-27 10:46:39,178481.0,view_item,android,item_id,1514
2,1b7822fa7b854e01970218ae8f721fe0,2017-06-27 11:15:39,178481.0,view_item,android,item_id,3712
3,2a7a188a626841ac94befcc419f06af4,2016-10-05 20:43:10,154133.0,view_item,android,item_id,3586
4,631d657264cc4616a4528f759509b25d,2016-10-04 03:29:10,154133.0,view_item,android,item_id,1061
5,05e4df2fa9044bf9a49a7351fdd4a6cd,2016-07-21 01:17:43,119514.0,view_item,web,item_id,550
6,22d3cdd566534fbdaa5e2982c1e64a75,2016-11-24 12:10:06,164581.0,view_item,web,item_id,982
7,cb0c825fe3804f42b602106580845b88,2016-11-23 21:13:06,164581.0,view_item,web,item_id,858

In [14]:
df_events.isnull().sum().sort_values(ascending=False)

event_id           0
event_time         0
user_id            0
event_name         0
platform           0
parameter_name     0
parameter_value    0
dtype: int64

In [56]:
df_events[df_events.isnull().any(axis=1)].head()

Empty DataFrame
Columns: [event_id, event_time, user_id, event_name, platform, parameter_name, parameter_value]
Index: []

In [57]:
df_events.duplicated().sum()

0

In [65]:
df_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 853640 entries, 0 to 853639
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   event_id         853640 non-null  object
 1   event_time       853640 non-null  object
 2   user_id          853640 non-null  float64
 3   event_name       853640 non-null  object
 4   platform         853640 non-null  object
 5   parameter_name   853640 non-null  object
 6   parameter_value  853640 non-null  object
dtypes: float64(1), object(6)
memory usage: 45.6+ MB

In [107]:
print(f'event_id:')
print(df_events.event_id.nunique())
print(f'event_time:')
print(df_events.event_time.nunique())
print(f'user_id:')
print(df_events.user_id.nunique())
print(f'event_name:')
print(df_events.event_name.nunique())
print(f'platform:')
print(df_events.platform.nunique())
print(f'parameter_name:')
print(df_events.parameter_name.nunique())
print(f'parameter_value:')
print(df_events.parameter_value.nunique())

event_id:
428364
event_time:
266020
user_id:
109624
event_name:
3
platform:
5
parameter_name:
5
parameter_value:
7418

**--------------------------------------------------------------------------------------------------------------------------------------------------------------------**

# df_date

In [10]:
df_date.head(8)

                  date               d7_ago              d28_ago
0  2018-06-01 00:00:00  2018-05-25 00:00:00  2018-05-04 00:00:00
1  2018-05-31 00:00:00  2018-05-24 00:00:00  2018-05-03 00:00:00
2  2018-05-30 00:00:00  2018-05-23 00:00:00  2018-05-02 00:00:00
3  2018-05-29 00:00:00  2018-05-22 00:00:00  2018-05-01 00:00:00
4  2018-05-28 00:00:00  2018-05-21 00:00:00  2018-04-30 00:00:00
5  2018-05-27 00:00:00  2018-05-20 00:00:00  2018-04-29 00:00:00
6  2018-05-26 00:00:00  2018-05-19 00:00:00  2018-04-28 00:00:00
7  2018-05-25 00:00:00  2018-05-18 00:00:00  2018-04-27 00:00:00

In [15]:
df_date.isnull().sum().sort_values(ascending=False)

date       0
d7_ago     0
d28_ago    0
dtype: int64

In [53]:
df_date[df_date.isnull().any(axis=1)].head()

Empty DataFrame
Columns: [date, d7_ago, d28_ago]
Index: []

In [55]:
df_date.duplicated().sum()

0

In [66]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1978 entries, 0 to 1977
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date     1978 non-null   object
 1   d7_ago   1978 non-null   object
 2   d28_ago  1978 non-null   object
dtypes: object(3)
memory usage: 46.5+ KB

In [108]:
print(f'date:')
print(df_date.date.nunique())
print(f'd7_ago:')
print(df_date.d7_ago.nunique())
print(f'd28_ago:')
print(df_date.d28_ago.nunique())

date:
1978
d7_ago:
1978
d28_ago:
1978

**--------------------------------------------------------------------------------------------------------------------------------------------------------------------**